Load_Outputs/scenario2/round1/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
01 Homepage,600,128,114,195,231,321,51,480,0.000%,6.00462,14.89,1.52
02 Stats API,600,73,66,102,121,196,28,323,0.000%,5.96338,4.95,1.65
03 CV Match API (file upload - multipart/form-data),300,813,347,1877,2590,6496,62,8667,96.333%,2.95820,13.24,8769.98
03 CV Match API (paste text - application/json),300,174,67,118,160,3835,26,5000,97.333%,3.00737,8.99,4.26
04 Subscribe API ,8,106,73,181,197,197,64,197,100.000%,.12731,0.10,2.77
04 Subscribe API,11,67,63,75,75,105,41,105,100.000%,.17784,0.14,3.88
TOTAL,1819,230,93,311,759,2989,26,8667,32.985%,17.57811,40.97,8605.91